In [105]:
import pandas as pd
import numpy as np

In [106]:
telco_data = pd.read_csv('Telco-Customer-Churn.csv')

In [107]:
telco_data.shape

(5634, 21)

In [108]:
telco_data.describe()

       SeniorCitizen       tenure  MonthlyCharges
count    5634.000000  5634.000000     5634.000000
mean        0.160809    32.373092       64.864253
std         0.367388    24.424539       30.089324
min         0.000000     0.000000       18.250000
25%         0.000000     9.000000       35.750000
50%         0.000000    29.000000       70.525000
75%         0.000000    55.000000       89.937500
max         1.000000    72.000000      118.600000

In [109]:
telco_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5634 entries, 0 to 5633
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Churn             5634 non-null   object
 1   customerID        5634 non-null   object
 2   gender            5634 non-null   object
 3   SeniorCitizen     5634 non-null   int64
 4   Partner           5634 non-null   object
 5   Dependents        5634 non-null   object
 6   tenure            5634 non-null   int64
 7   PhoneService      5634 non-null   object
 8   MultipleLines     5634 non-null   object
 9   InternetService   5634 non-null   object
 10  OnlineSecurity    5634 non-null   object
 11  OnlineBackup      5634 non-null   object
 12  DeviceProtection  5634 non-null   object
 13  TechSupport       5634 non-null   object
 14  StreamingTV       5634 non-null   object
 15  StreamingMovies   5634 non-null   object
 16  Contract          5634 non-null   object
 17  PaperlessBilling  5634 non-null   object
 18  PaymentMethod     5634 non-null   object
 19  MonthlyCharges    5634 non-null   float64
 20  TotalCharges      5634 non-null   object
dtypes: float64(1), int64(2), object(18)
memory usage: 924.5+ KB

Alcuni valori categorici delle colonne che non hanno solo Yes/No.

Le colonne OnlineSecurity, OnlineBackup, DeviceProtection, TechSupport, StreamingTV, StreamingMovies hanno tutte valori Yes/No/No internet service

In [110]:
pd.unique(telco_data.MultipleLines)

array(['No', 'Yes', 'No phone service'], dtype=object)

In [111]:
pd.unique(telco_data.InternetService)

array(['DSL', 'Fiber optic', 'No'], dtype=object)

In [112]:
pd.unique(telco_data.Contract)

array(['One year', 'Two year', 'Month-to-month'], dtype=object)

In [113]:
pd.unique(telco_data.PaymentMethod)

array(['Mailed check', 'Bank transfer (automatic)', 'Electronic check',
       'Credit card (automatic)'], dtype=object)

La colonna TotalCharges ha dei valori vuoti (solo 10, conviene cancellare le righe rispetto a tutta la colonna)

In [114]:
telco_data.TotalCharges.head()

0     1336.8
1    5129.45
2      23.45
3     237.95
4
Name: TotalCharges, dtype: object

In [115]:
(telco_data.TotalCharges.values == ' ').sum()

10

Rimpiazzo ' ' con NaN e elimino le righe corrispondenti, convertendo poi la colonna TotalCharges in float

In [116]:
telco_data['TotalCharges'].replace(' ', np.nan, inplace=True)

In [121]:
telco_data = telco_data.dropna()

In [122]:
telco_data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 5624 entries, 0 to 5633
Data columns (total 21 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Churn             5624 non-null   object
 1   customerID        5624 non-null   object
 2   gender            5624 non-null   object
 3   SeniorCitizen     5624 non-null   int64
 4   Partner           5624 non-null   object
 5   Dependents        5624 non-null   object
 6   tenure            5624 non-null   int64
 7   PhoneService      5624 non-null   object
 8   MultipleLines     5624 non-null   object
 9   InternetService   5624 non-null   object
 10  OnlineSecurity    5624 non-null   object
 11  OnlineBackup      5624 non-null   object
 12  DeviceProtection  5624 non-null   object
 13  TechSupport       5624 non-null   object
 14  StreamingTV       5624 non-null   object
 15  StreamingMovies   5624 non-null   object
 16  Contract          5624 non-null   object
 17  PaperlessBilling  5624 non-null   object
 18  PaymentMethod     5624 non-null   object
 19  MonthlyCharges    5624 non-null   float64
 20  TotalCharges      5624 non-null   object
dtypes: float64(1), int64(2), object(18)
memory usage: 966.6+ KB

In [123]:
telco_data['TotalCharges'] = telco_data['TotalCharges'].astype(float)

In [126]:
telco_data.describe()

       SeniorCitizen       tenure  MonthlyCharges  TotalCharges
count    5624.000000  5624.000000     5624.000000   5624.000000
mean        0.161095    32.430654       64.911620   2291.154605
std         0.367652    24.408029       30.081601   2263.151534
min         0.000000     1.000000       18.250000     18.800000
25%         0.000000     9.000000       35.800000    411.512500
50%         0.000000    29.000000       70.550000   1410.800000
75%         0.000000    55.000000       89.950000   3808.850000
max         1.000000    72.000000      118.600000   8684.800000